Documents/СтопФакторыБанков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Document>
		<Properties>
			<Name>СтопФакторыБанков</Name>
			<BasedOn>
				<xr:Item>Document.СтопФакторыБанков</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтопФакторыБанков</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СтопФакторыБанков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСтопФакторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИпотечныйБанк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УсловияКредитования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеКредитования</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПримененияСтавок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>cfg:CatalogRef.ПараметрыПримененияСтавок_Значения</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ВидыОперацийСтопФакторы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСтопФакторы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СтопФакторыБанков/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем Группа;

&НаКлиенте
Процедура УсловияКредитованияЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ПараметрыОтбора = Новый Структура("Владелец",Элементы.УсловияКредитования.ТекущиеДанные.УсловиеКредитования);
	ФормаВыбора = ПолучитьФорму("Справочник.ПараметрыПримененияСтавок_Значения.Форма.ФормаВыбораОдноЗначение",Новый Структура("Отбор", ПараметрыОтбора),Элемент);
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлемент(Команда)
	
	ТекДанные = Элементы.Дерево.ТекущиеДанные;
	
	Если ТекДанные = Неопределено  Тогда
		Элемент = Дерево.ПолучитьЭлементы().Добавить();	
	ИначеЕсли ТекДанные.Строка = Истина Тогда
		Элемент = Дерево.ПолучитьЭлементы().Добавить();	
	Иначе
		ТекЭлементы = ТекДанные.ПолучитьЭлементы();
		Элемент = ТекЭлементы.Добавить();
	КонецЕсли;
	
	Элемент.Строка = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	Группа = Дерево.ПолучитьЭлементы().Добавить();	
	Группа.УсловиеКредитования = "Группа";
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоСтопФакторНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
КонецПроцедуры


&НаКлиенте
Процедура ДеревоПередНачаломИзменения(Элемент, Отказ)
	
	ТекДанные = Элементы.Дерево.ТекущиеДанные;
	ЭлементСтопФактор = Элемент.ПодчиненныеЭлементы.ДеревоСтопФактор;
	
	Если ТекДанные.Строка  Тогда
            ЭлементСтопФактор.ОграничениеТипа = Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ПараметрыПримененияСтавок");
            ДанныеВыбора = ЭлементСтопФактор.ОграничениеТипа.ПривестиЗначение(ПредопределенноеЗначение("ПланВидовХарактеристик.ПараметрыПримененияСтавок.ПустаяСсылка"));      
		Иначе
		    ЭлементСтопФактор.ОграничениеТипа = Новый ОписаниеТипов("Строка");
            ДанныеВыбора = ЭлементСтопФактор.ОграничениеТипа.ПривестиЗначение(""); 	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСтрокуВТЧ(Строка, Группа=0)
	
	СтрТЧ = Объект.УсловияКредитования.Добавить();
	СтрТЧ.УсловиеКредитования = Строка.УсловиеКредитования;
	СтрТЧ.Значение = Строка.Значение;
	СтрТЧ.Группа = Группа;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.УсловияКредитования.Очистить();
	
	ДанныеДерева = Дерево.ПолучитьЭлементы();
	Группа= 0;
	Для Каждого Эл Из ДанныеДерева Цикл
		Если НЕ Эл.Строка Тогда
			Группа = Группа+1;
			СтрокиГруппы = Эл.ПолучитьЭлементы();
			Для Каждого Строка Из СтрокиГруппы Цикл
				ДобавитьСтрокуВТЧ(Строка,Группа);	
			КонецЦикла;
		Иначе
				ДобавитьСтрокуВТЧ(Эл);	
		КонецЕсли;                  
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НарисоватьДерево();
КонецПроцедуры

&НаКлиенте
Процедура НарисоватьДерево()
	
	Для Каждого Стр Из Объект.УсловияКредитования Цикл
		Если Стр.Группа = 0 Тогда
			ДобавитьЭлементСтрока(Дерево, Стр);
		Иначе
			Родитель = ОпределитьРодителя(Стр.Группа);
			ДобавитьЭлементСтрока(Родитель, Стр);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементСтрока(Родитель, Стр)
	
	Элемент = Родитель.ПолучитьЭлементы().Добавить();	
	ЗаполнитьЗначенияСвойств(Элемент, Стр);
	Элемент.Строка = Истина;
	
КонецПроцедуры

&НаКлиенте
Функция ОпределитьРодителя(НомерГруппы)
	ВерхнийУровень = Дерево.ПолучитьЭлементы();
	Родитель = Неопределено;
	
	Для Каждого Стр Из ВерхнийУровень Цикл
		Если Стр.Группа = НомерГруппы Тогда
			Родитель = Стр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Родитель= Неопределено Тогда
		Родитель = Дерево.ПолучитьЭлементы().Добавить();	
		Родитель.УсловиеКредитования = "Группа";
		Родитель.Группа = НомерГруппы;
	КонецЕсли;
	
	Возврат Родитель;
КонецФункции

&НаКлиенте
Процедура Удалить(Команда)
	
	ТекДанные = Элементы.Дерево.ТекущиеДанные;
	Если ТекДанные = Неопределено  Тогда
		Возврат;	
	КонецЕсли;
	
	Дерево.ПолучитьЭлементы().Удалить(ТекДанные);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
	Объект.ВидОперации = Перечисления.ВидыОперацийСтопФакторы.Установка;
	КонецЕсли;
КонецПроцедуры
